# Shell / prompt
brew "pure"
brew "fzf"
brew "coreutils"  # gstdbuf (line-buffered ask streaming), gtruncate, etc.
brew "zsh-autosuggestions"     # ghost-text completion from history
brew "zsh-syntax-highlighting" # commands turn green when valid, red when not
brew "zoxide"                  # smarter cd — `z foo` jumps to most-used matching dir
brew "fzf-tab"                 # fzf-powered tab completions

# Search / inspect
brew "ripgrep"
brew "the_silver_searcher"
brew "bat"
brew "eza"           # modern ls with git status + tree
brew "jq"
brew "yq"            # jq for YAML — pairs with k8s manifests
brew "tealdeer"      # `tldr <cmd>` — community-curated examples

# Diff
brew "difftastic"

# Editor
brew "neovim"

# Remote dev sandbox
brew "tmux"          # durable sessions on the server — `devbox` runs jobs inside one

# Dev workflow
brew "gh"            # GitHub CLI
brew "direnv"        # per-dir env via .envrc (hook is wired in .zshrc)
brew "mkcert"        # local TLS certs for dev
brew "uv"            # Python packaging (per CLAUDE.md)
brew "ruff"          # Python lint + format
brew "oven-sh/bun/bun"  # JS runtime used by devbox-playwright (and preferred over npm/pnpm per CLAUDE.md)

# Kubernetes
brew "k9s"           # TUI dashboard
brew "kubectx"       # ctx + ns switcher (includes kubens)
brew "stern"         # multi-pod log tailing
brew "helm"          # k8s package manager
brew "eksctl"        # eks cli

# Cloud / data
brew "awscli"
brew "aws-vault"     # secure AWS credential storage
brew "gdal"
